In [3]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd
data = DataFrame(np.arange(16).reshape(4,4),
                index = ['ohio','colorado','utah','new york'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [4]:
data['two']

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [5]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [6]:
data.ix['colorado',['two','three']]

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: colorado, dtype: int32

In [8]:
data.ix[['colorado','utah'],[3,0,1]]

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
colorado     7    4    5
utah        11    8    9

In [13]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns = list('bcd'),
index = ['ohio','texas','colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns = list('bde'),
index = ['utah','ohio','texas','oregon'])

df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [14]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [15]:
df1+df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [16]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns = list('abcde'))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [17]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [18]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [19]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
df1.reindex(columns=df2.columns,fill_value=0)
#use df2 columns name and fill nan with 0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [22]:
obj = Series(range(4),index =['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [24]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','four'],
               columns=['d','a','b','c'])
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
four   5  6  7  4

In [27]:
obj=pd.Series([4,np.nan,5,7,np.nan])
obj.sort_values()
#same with obj.order()

0    4.0
2    5.0
3    7.0
1    NaN
4    NaN
dtype: float64

In [30]:
#default order is ascending order
from pandas import Series
obj=Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [31]:
# Create dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [32]:
# Create a new column that is the rank of the value of coverage in ascending order
df['coverageRanked'] = df['coverage'].rank(ascending=1)
df

             name  year  reports  coverage  coverageRanked
Cochice     Jason  2012        4        25             1.0
Pima        Molly  2012       24        94             5.0
Santa Cruz   Tina  2013       31        57             2.0
Maricopa     Jake  2014        2        62             3.0
Yuma          Amy  2014        3        70             4.0

In [33]:
s=pd.Series([np.nan, 1,3,10,5])
s

0     NaN
1     1.0
2     3.0
3    10.0
4     5.0
dtype: float64

In [34]:
s.sort_values(ascending=True) #by default nan is unlimited value , so treat as biggest value.

1     1.0
2     3.0
4     5.0
3    10.0
0     NaN
dtype: float64

In [35]:
s.sort_values(ascending=False, inplace=True)

In [36]:
s

3    10.0
4     5.0
2     3.0
1     1.0
0     NaN
dtype: float64

In [37]:
s.sort_values(na_position = 'first')

0     NaN
1     1.0
2     3.0
4     5.0
3    10.0
dtype: float64

In [38]:
obj=Series(range(5),index=['a','b','c','d','e'])
obj.index.is_unique

True

In [39]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75,-1.3]],
              index=['a','b','c','d'],
              columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [40]:
df.sum() # return columns sum

one    9.25
two   -5.80
dtype: float64

In [42]:
df.sum(axis=1) #return row sum

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [43]:
df.mean(axis=1,skipna=False) #nan sum other return nan, skipna is false

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [44]:
df.idxmax() #return max value index for each column

one    b
two    d
dtype: object

In [45]:
df.idxmin() #min value index number for each column

one    d
two    b
dtype: object

In [46]:
df.cumsum() # accumulate value for next row.

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [47]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [55]:
#correlation and covariance 

import pandas_datareader.data as web
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]=web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')
price = DataFrame({tic:data['Adj Close']
                  for tic, data in all_data.items()})
volume = DataFrame({tic:data['Volume']
                  for tic, data in all_data.items()})
returns= price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012295  0.013326  0.005484  0.007098
2009-12-29 -0.011862 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013698  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

In [56]:
returns.MSFT.corr(returns.IBM)

0.49414979091371913

In [57]:
returns.MSFT.cov(returns.IBM)

0.00021571262191850244

In [58]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410011  0.423556  0.470676
IBM   0.410011  1.000000  0.494150  0.390688
MSFT  0.423556  0.494150  1.000000  0.438313
GOOG  0.470676  0.390688  0.438313  1.000000

In [59]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000519  0.000204
GOOG  0.000303  0.000142  0.000204  0.000580

In [60]:
returns.corrwith(returns.IBM)

AAPL    0.410011
IBM     1.000000
MSFT    0.494150
GOOG    0.390688
dtype: float64

In [61]:
returns.corrwith(volume)

AAPL   -0.057549
IBM    -0.007892
MSFT   -0.016118
GOOG    0.062647
dtype: float64

In [64]:
obj=Series(['c','a','d','d','a','c','e'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'e'], dtype=object)

In [65]:
obj.value_counts()

a    2
d    2
c    2
e    1
dtype: int64

In [66]:
pd.value_counts(obj.values,sort=False)

c    2
d    2
e    1
a    2
dtype: int64

In [67]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [68]:
obj[mask]

0    c
5    c
dtype: object

In [69]:
#handling missing data
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [70]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [71]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [72]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [74]:
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],
                [NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [75]:
cleaned = data.dropna()
cleaned #drop the rows that contains NA

     0    1    2
0  1.0  6.5  3.0

In [76]:
data.dropna(how='all') #will drop rows that contains all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [77]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [78]:
data.dropna(axis=1,how='all') #drop columns that contains all na use axis1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [79]:
df = DataFrame(np.random.randn(7,3))
df.ix[:4,1]=NA;df.ix[:2,2]=NA

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [80]:
df

          0         1         2
0 -0.474547       NaN       NaN
1 -0.354612       NaN       NaN
2 -0.237109       NaN       NaN
3  1.524111       NaN -1.075540
4  0.413798       NaN  1.130497
5  0.732739  0.702783  1.098624
6 -0.288856  0.020773 -0.879741

In [81]:
df.dropna(thresh=3) # i want to keep the rows that contain 3 observations

          0         1         2
5  0.732739  0.702783  1.098624
6 -0.288856  0.020773 -0.879741

In [82]:
#fill missing data
df.fillna(0) #fill nan with 0

          0         1         2
0 -0.474547  0.000000  0.000000
1 -0.354612  0.000000  0.000000
2 -0.237109  0.000000  0.000000
3  1.524111  0.000000 -1.075540
4  0.413798  0.000000  1.130497
5  0.732739  0.702783  1.098624
6 -0.288856  0.020773 -0.879741

In [84]:
df.fillna({1:0.5,3:-1}) #fill column 1 's nan with 0.5 and column3(not exist) with -1

          0         1         2
0 -0.474547  0.500000       NaN
1 -0.354612  0.500000       NaN
2 -0.237109  0.500000       NaN
3  1.524111  0.500000 -1.075540
4  0.413798  0.500000  1.130497
5  0.732739  0.702783  1.098624
6 -0.288856  0.020773 -0.879741

In [85]:
_=df.fillna(0,inplace=True)

In [86]:
df

          0         1         2
0 -0.474547  0.000000  0.000000
1 -0.354612  0.000000  0.000000
2 -0.237109  0.000000  0.000000
3  1.524111  0.000000 -1.075540
4  0.413798  0.000000  1.130497
5  0.732739  0.702783  1.098624
6 -0.288856  0.020773 -0.879741

In [92]:
df=DataFrame(np.random.randn(6,3))
df.ix[2:,1] = NA;df.ix[4:,2]=NA
df

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          0         1         2
0  1.303794  0.607151  0.457141
1  1.229449  0.519014 -0.764549
2  0.962063       NaN  0.429673
3 -0.697078       NaN  0.190452
4  0.038811       NaN       NaN
5 -0.584953       NaN       NaN

In [93]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.303794  0.607151  0.457141
1  1.229449  0.519014 -0.764549
2  0.962063  0.519014  0.429673
3 -0.697078  0.519014  0.190452
4  0.038811       NaN  0.190452
5 -0.584953       NaN  0.190452

In [95]:
#hierarchical indexing
data=Series(np.random.randn(10),
           index=[['a','a','a','b','b','b','c','c','d','d'],
                 [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.141836
   2   -0.760493
   3   -0.660272
b  1    1.078003
   2    0.817442
   3    0.020104
c  1   -0.327031
   2   -0.057459
d  2    1.376997
   3   -0.682631
dtype: float64

In [96]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [97]:
data['b']

1    1.078003
2    0.817442
3    0.020104
dtype: float64

In [98]:
data.ix[['b','d']]

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    1.078003
   2    0.817442
   3    0.020104
d  2    1.376997
   3   -0.682631
dtype: float64

In [99]:
data['b':'c']

b  1    1.078003
   2    0.817442
   3    0.020104
c  1   -0.327031
   2   -0.057459
dtype: float64

In [100]:
data[:,2]

a   -0.760493
b    0.817442
c   -0.057459
d    1.376997
dtype: float64

In [101]:
#hierachical index is important for like pivot table
#unstack method will rearrange the data into data frame.
data.unstack()

          1         2         3
a -0.141836 -0.760493 -0.660272
b  1.078003  0.817442  0.020104
c -0.327031 -0.057459       NaN
d       NaN  1.376997 -0.682631

In [102]:
data.unstack().stack() #this is inverse operation of unstack

a  1   -0.141836
   2   -0.760493
   3   -0.660272
b  1    1.078003
   2    0.817442
   3    0.020104
c  1   -0.327031
   2   -0.057459
d  2    1.376997
   3   -0.682631
dtype: float64

In [103]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns = [['Ohio','Ohio','Colorado'],
                            ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [104]:
frame.index.names=['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [105]:
frame['Ohio'] #select group of frame

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [106]:
#reorder and sort levels
frame.swaplevel('key1','key2')
#the swamplevel takes two level numbers or names and returns a new project with the levels interchanged.
#the data is unaltered. just add key 1 nad key 2

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [107]:
frame.sortlevel(1)

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [108]:
frame.swaplevel(0,1).sortlevel(0)

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [109]:
frame.sum(level='key2') #sum by key2 and key1

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [110]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [111]:
frame=DataFrame({'a':range(7),'b':range(7,0,-1),
                'c':['one','one','one','two','two','two','two'],
                'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [112]:
frame2=frame.set_index(['c','d']) #this will create new data frame drop cd

In [113]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [114]:
frame.set_index(['c','d'],drop=False) #by default drop is true
#set index will create new df use one or more of its columns as the index

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [115]:
frame2.reset_index()#reset index will move hierarchical index levels to the columns

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1